// # Завдання 5

// Створіть об'єкт `car`, який містить властивості марка, модель, рік випуску,
// швидкість.

// Створіть ще один обʼєкт `location`, який містить властивість `city` та
// `distance`

// Створіть метод обʼєкта car `showInfo()`, який виводить інформацію про автомобіль
// на екран у форматі
// `Марка: <марка>; Модель: <модель>; Рік випуску: <рік випуску>; `.

// Створіть функцію `showTime()`, яка буде вираховувати за який час автомобіль
// доїде до міста `city` та виводити в консоль повідомлення в форматі
// `Автомобіль {brand}, марки {model} дістанеться міста {city} за {time}`

// Використовуйте обєднання обʼєктів, метод forEach та ключове слово this для
// доступу до властивостей об'єкту.

const car={
    brand:'Volvo',
    model:"xc90",
    year:2019,
    speed:200,
    showInfo(){
        return `Марка: ${this.brand}; Модель: ${this.model}; Рік випуску: ${this.year}; `
    },

   showTime(city,distance){
    return `Автомобіль ${this.brand}, марки ${this.model} дістанеться міста ${city} за ${(distance/this.speed)} години`;
},
};

